### 복습
1. uriage.csv 파일 로드 
2. 결측치 조회
3. purchase_date 컬럼의 값을 시계열데이터 변경
4. item_name의 값들을 전부 대문자로 변환
5. item_name의 값들의 공백을 전부 제거 (글자 사이의 공백도 제거)
6. item_name을 기준으로 오름차순 정렬
7. 인덱스 값을 재지정(리셋 기존의 인덱스는 삭제)

In [1]:
import pandas as pd

In [2]:
## 파일 로드 
df = pd.read_csv("../csv/uriage.csv")
df.head()

      purchase_date item_name  item_price customer_name
0  2019-06-13 18:02       상품A       100.0           김가온
1  2019-07-13 13:05     상 품 S         NaN           김우찬
2  2019-05-11 19:42     상 품 a         NaN           김유찬
3  2019-02-12 23:40       상품Z      2600.0           김재현
4   2019-04-22 3:09       상품a         NaN           김강현

In [4]:
## purchase_date 컬럼의 값을 시계열데이터 변경
df['purchase_date'] = pd.to_datetime(df['purchase_date'], format="%Y-%m-%d %H:%M")

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2999 entries, 0 to 2998
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   purchase_date  2999 non-null   datetime64[ns]
 1   item_name      2999 non-null   object
 2   item_price     2612 non-null   float64
 3   customer_name  2999 non-null   object
dtypes: datetime64[ns](1), float64(1), object(2)
memory usage: 93.8+ KB

In [7]:
## item_name의 값들을 전부 대문자로 변환
df['item_name'] = df['item_name'].str.upper()
df.head()

        purchase_date item_name  item_price customer_name
0 2019-06-13 18:02:00       상품A       100.0           김가온
1 2019-07-13 13:05:00     상 품 S         NaN           김우찬
2 2019-05-11 19:42:00     상 품 A         NaN           김유찬
3 2019-02-12 23:40:00       상품Z      2600.0           김재현
4 2019-04-22 03:09:00       상품A         NaN           김강현

In [12]:
## item_name의 값들의 공백을 모두 제거
# case1
df['item_name'].str.replace(" ", "")
# case2
df['item_name'].apply(lambda x : x.replace(" ", ""))
# case3
def change(x):
    x = x.upper()
    x = x.replace(" ", "")
    return x
df['item_name'] = df['item_name'].apply(change)

In [14]:
## item_name 값을 기준으로 오름차순 정렬
df = df.sort_values("item_name")

In [16]:
## 인덱스의 값을 재지정(기존의 인덱스는 삭제)
df.reset_index(drop=True, inplace=True)

In [17]:
## datetime을 이용하여 요일 출력
## dt.weekday
## 0 : 월 , ..., 6 : 일
## 요일 컬럼의 생성
df["요일"] = df['purchase_date'].dt.weekday

In [18]:
df.head()

        purchase_date item_name  item_price customer_name  요일
0 2019-06-13 18:02:00       상품A       100.0           김가온   3
1 2019-05-19 20:22:00       상품A       100.0           김시훈   6
2 2019-06-25 08:13:00       상품A       100.0           김유진   1
3 2019-06-13 16:03:00       상품A       100.0           김건희   3
4 2019-02-10 00:28:00       상품A       100.0           김하랑   6

In [22]:
## 요일 컬럼의 데이터를 
## 0 -> 월 , .... 6 -> 일 의 형태로 데이터를 변환
## 
def week_name(x):
    if x == 0:
        return '월'
    elif x == 1:
        return '화'
    elif x == 2 : 
        return '수'
    elif x == 3 : 
        return '목'
    elif x == 4 : 
        return '금'
    elif x == 5 : 
        return '토'
    elif x == 6 :
        return '일'
    else :
        return 'error'
df['요일'].apply(week_name)

0       목
1       일
2       화
3       목
4       일
       ..
2994    월
2995    화
2996    목
2997    화
2998    화
Name: 요일, Length: 2999, dtype: object

In [24]:
df['purchase_date'].dt.day_name()

0       Thursday
1         Sunday
2        Tuesday
3       Thursday
4         Sunday
          ...
2994      Monday
2995     Tuesday
2996    Thursday
2997     Tuesday
2998     Tuesday
Name: purchase_date, Length: 2999, dtype: object